Дошкольное_учреждение83/src/Catalogs/удуОтправкаДокумента/удуОтправкаДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуОтправкаДокумента</name>
  <basedOn>Catalog.ИсходящиеДокументы</basedOn>
  <owners>Catalog.ИсходящиеДокументы</owners>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоставки</name>
    <type>
      <types>CatalogRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРеестра</name>
    <type>
      <types>CatalogRef.удуТипыРеестров</types>
    </type>
  </attributes>
  <attributes>
    <name>РеестрОтправки</name>
    <type>
      <types>CatalogRef.удуРеестрыОтправки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Корреспонденты</types>
      </type>
    </attributes>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДоставки</name>
      <type>
        <types>CatalogRef.СпособыДоставки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Catalogs/удуОтправкаДокумента/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ИсходящиеДокументы") Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.РегистрационныйНомер) Тогда
		// Заполнение шапки
	
		Наименование = ДанныеЗаполнения.Наименование;
		Основание = ДанныеЗаполнения.Ссылка;
		Владелец = ДанныеЗаполнения.Ссылка;
		Если ТипЗнч(ДанныеЗаполнения.Получатель) = Тип("СправочникСсылка.Корреспонденты") Тогда
			ПолучательДок = Получатели.Добавить();
			ПолучательДок.Получатель = ДанныеЗаполнения.Получатель;
			ПолучательДок.Адресат = ДанныеЗаполнения.Адресат;
		Иначе
			Если ТипЗнч(ДанныеЗаполнения.Получатель) = Тип("СправочникСсылка.СпискиРассылкиПоКорреспондентам") Тогда
				Для Каждого Корреспондент Из ДанныеЗаполнения.Получатель.Получатели Цикл
					ПолучательДок = Получатели.Добавить();
					ПолучательДок.Получатель = Корреспондент.Получатель;
					ПолучательДок.Адресат = Корреспондент.Адресат;
				КонецЦикла;	
			КонецЕсли;
		КонецЕсли;
	Иначе
		Сообщить ("Документ еще не зарегистрирован");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры
